<a href="https://colab.research.google.com/github/Suchitra-V31/Handling-Missing-values/blob/main/Handling_Categorical_values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Handling Categorical Features**

**One hot Encoding**

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic=sns.load_dataset('titanic')

In [3]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [4]:
data=pd.DataFrame(columns=['sex'],data=titanic)

In [5]:
data.head()

      sex
0    male
1  female
2  female
3  female
4    male

In [6]:
# we change this categorical features to 0's and 1's using  get_dummies
pd.get_dummies(data).head()

   sex_female  sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

Since one column is enough to obtain the required information(whether it is male or female) we can drop the first column

In [ ]:
pd.get_dummies(data,drop_first=True).head()

   sex_male
0         1
1         0
2         0
3         0
4         1

From this we can conclude , 1 - Male ; 0 - Female

**One Hot Encoding with many Categories in a feature**

In [7]:
benz=pd.read_csv('/content/benz-train data.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])
benz.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [8]:
for i in benz.columns:
  print(len(benz[i].unique()))

47
27
44
7
4
29
12

Since it has more categorical features performing one hot encoding for all will not work.So we just perform one hot encoding for the top 10 categorical features.

In [9]:
benz['X0'].value_counts().sort_values(ascending=False).head(10)

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
Name: X0, dtype: int64

These are the 10 most frequent categories. We can create a list of these features.

In [10]:
top_10=benz['X0'].value_counts().sort_values(ascending=False).head(10).index
top_10=list(top_10)

In [11]:
top_10

['z', 'ak', 'y', 'ay', 't', 'x', 'o', 'f', 'n', 'w']

In [12]:
import numpy as np
for categories in top_10:
  benz[categories]=np.where(benz['X0']==categories,1,0)

In [13]:
top_10.append('X0')

In [14]:
benz[top_10].head(10)

   z  ak  y  ay  t  x  o  f  n  w  X0
0  0   0  0   0  0  0  0  0  0  0   k
1  0   0  0   0  0  0  0  0  0  0   k
2  0   0  0   0  0  0  0  0  0  0  az
3  0   0  0   0  0  0  0  0  0  0  az
4  0   0  0   0  0  0  0  0  0  0  az
5  0   0  0   0  1  0  0  0  0  0   t
6  0   0  0   0  0  0  0  0  0  0  al
7  0   0  0   0  0  0  1  0  0  0   o
8  0   0  0   0  0  0  0  0  0  1   w
9  0   0  0   0  0  0  0  0  0  0   j

**Ordinal Number Encoding**

In [15]:
import datetime

In [65]:
today_date=datetime.datetime.now()
today_date

datetime.datetime(2021, 8, 1, 7, 1, 28, 260650)

In [66]:
today_date-datetime.timedelta(1)

datetime.datetime(2021, 7, 31, 7, 1, 28, 260650)

In [67]:
#let's create a record of 15 days 
day=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [68]:
day

[datetime.datetime(2021, 8, 1, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 31, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 30, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 29, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 28, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 27, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 26, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 25, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 24, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 23, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 22, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 21, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 20, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 19, 7, 1, 28, 260650),
 datetime.datetime(2021, 7, 18, 7, 1, 28, 260650)]

In [69]:
# let's create a dataframe of these records
import pandas as pd

In [70]:
data=pd.DataFrame(day,columns=['Day'])

In [71]:
data.head(10)

                         Day
0 2021-08-01 07:01:28.260650
1 2021-07-31 07:01:28.260650
2 2021-07-30 07:01:28.260650
3 2021-07-29 07:01:28.260650
4 2021-07-28 07:01:28.260650
5 2021-07-27 07:01:28.260650
6 2021-07-26 07:01:28.260650
7 2021-07-25 07:01:28.260650
8 2021-07-24 07:01:28.260650
9 2021-07-23 07:01:28.260650

In [84]:
# we can also get the year/date/day...seperately using datetime  module fn
data['Day'].dt.weekday

0     6
1     5
2     4
3     3
4     2
5     1
6     0
7     6
8     5
9     4
10    3
11    2
12    1
13    0
14    6
Name: Day, dtype: int64

In this we could get the ordinal numbers for the weekday_name.

In [73]:
dictionary={'Monday':0,'Tuesday':1,'Wednesday':2,'Thursday':3,'Friday':4,'Saturday':5,'Sunday':6}

By using dictionary we can create our required ordinal number for each  category and map them with the original data to create a new column with the ordinal numbers.

**Count or Fequency Encoding**

In [85]:
benz=pd.read_csv('/content/benz-train data.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])
benz.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [96]:
for feature in benz.columns:
  print(feature,':',len(benz[feature].unique()),'labels')

X0 : 47 labels
X1 : 27 labels
X2 : 44 labels
X3 : 7 labels
X4 : 4 labels
X5 : 29 labels
X6 : 12 labels

Since X0 has more labels we can either replace them with the top 10 or we can replace them with the count of each feature.

In [101]:
X0_count=benz['X0'].value_counts().to_dict()

In [103]:
benz['X0']=benz['X0'].map(X0_count)

In [104]:
benz.head()

    X0 X1  X2 X3 X4 X5 X6
0   11  v  at  a  d  u  j
1   11  t  av  e  d  y  l
2  175  w   n  c  d  x  j
3  175  t   n  f  d  x  l
4  175  v   n  f  d  h  d

In this we can see that the X0 labels are replaced with its value_counts.

**ADVANTAGES:**

1.Easy To Use

2.Not increasing feature space

**DISADVANTAGE:**

1.It  will provide same weight if the frequencies are same

**Target Guided Ordinal Encoding**

In this we will be ordering the labels according to the target or we can replace the labels with joint probability of 0 or 1.

In [140]:
titanic=pd.read_csv('/content/train.csv',usecols=['Survived','Cabin'])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [156]:
titanic['Cabin'].fillna('Missing',inplace=True)

In [157]:
titanic.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [143]:
titanic['Cabin']=titanic['Cabin'].astype(str).str[0]

In [144]:
titanic.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

Now the Cabin variables are replaced with the 1st letter of the variable

In [145]:
titanic['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [146]:
titanic.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [147]:
ordinal_var=titanic.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [148]:
ordinal_labels={k:i for i,k in enumerate(ordinal_var,0)}
ordinal_labels

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [149]:
titanic['Cabin_ordinal']=titanic['Cabin'].map(ordinal_labels)

In [150]:
titanic.head()

   Survived Cabin  Cabin_ordinal
0         0     M              1
1         1     C              4
2         1     M              1
3         1     C              4
4         0     M              1

So now we have created a ordinal value for cabin

**Mean Encoding**

It is nothing but replacing with the mean value.

In [151]:
titanic.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [158]:
Cabin_mean=titanic.groupby(['Cabin'])['Survived'].mean().to_dict()

In [160]:
titanic['mean_ordinal_encode']=titanic['Cabin'].map(Cabin_mean)
titanic.head()

   Survived    Cabin  mean_ordinal_encode
0         0  Missing             0.299854
1         1      C85             1.000000
2         1  Missing             0.299854
3         1     C123             0.500000
4         0  Missing             0.299854

**Probability Ratio Encoding**

It is just replacing the cabin with its probability ratio

In [181]:
titanic=pd.read_csv('/content/train.csv',usecols=['Survived','Cabin'])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [182]:
titanic['Cabin'].fillna('Missing',inplace=True)
titanic.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [183]:
titanic['Cabin']=titanic['Cabin'].astype(str).str[0]
titanic.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [184]:
prob_data=titanic.groupby(['Cabin'])['Survived'].mean()

In [185]:
prob_data=pd.DataFrame(prob_data)

In [186]:
prob_data.head()

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000

In [187]:
# let's find the death probability
prob_data['Died']=1-prob_data['Survived']

In [188]:
prob_data.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In order to find the probability ratio we need to divide the survived probability with the died probabiliy

In [189]:
prob_data['prob_ratio']=prob_data['Survived']/prob_data['Died']

In [190]:
prob_data.head()

       Survived      Died  prob_ratio
Cabin
A      0.466667  0.533333    0.875000
B      0.744681  0.255319    2.916667
C      0.593220  0.406780    1.458333
D      0.757576  0.242424    3.125000
E      0.750000  0.250000    3.000000

In [191]:
cabin_prob_ratio=prob_data['prob_ratio'].to_dict()

In [196]:
titanic['Cabin_prob']=titanic['Cabin'].map(cabin_prob_ratio)

In [197]:
titanic.head()

   Survived Cabin  Cabin_prob
0         0     M    0.428274
1         1     C    1.458333
2         1     M    0.428274
3         1     C    1.458333
4         0     M    0.428274